7767517
82 97
Input            input                    0 1 input
Convolution      Conv_0                   1 1 input input.4 0=24 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=648
ReLU             Relu_1                   1 1 input.4 onnx::Conv_173
ConvolutionDepthWise Conv_2                   1 1 onnx::Conv_173 input.12 0=24 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=216 7=24
ReLU             Relu_3                   1 1 input.12 onnx::Conv_176
Convolution      Conv_4                   1 1 onnx::Conv_176 input.20 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1152
Split            splitncnn_0              1 2 input.20 input.20_splitncnn_0 input.20_splitncnn_1
ConvolutionDepthWise Conv_5                   1 1 input.20_splitncnn_1 input.28 0=48 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=432 7=48
ReLU             Relu_6                   1 1 input.28 onnx::Conv_181
Convolution      Conv_7                   1 1 onnx::Conv_181 onnx::Add_626 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
BinaryOp         Add_8                    2 1 input.20_splitncnn_0 onnx::Add_626 input.36 0=0
Convolution      Conv_9                   1 1 input.36 input.44 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
ReLU             Relu_10                  1 1 input.44 onnx::Conv_187
ConvolutionDepthWise Conv_11                  1 1 onnx::Conv_187 input.52 0=192 1=3 11=3 2=1 12=1 3=1 13=2 4=1 14=1 15=1 16=1 5=1 6=1728 7=192
ReLU             Relu_12                  1 1 input.52 onnx::Conv_190
Convolution      Conv_13                  1 1 onnx::Conv_190 input.60 0=72 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=13824
Split            splitncnn_1              1 2 input.60 input.60_splitncnn_0 input.60_splitncnn_1
Convolution      Conv_14                  1 1 input.60_splitncnn_1 input.68 0=288 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=20736
ReLU             Relu_15                  1 1 input.68 onnx::Conv_195
ConvolutionDepthWise Conv_16                  1 1 onnx::Conv_195 input.76 0=288 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2592 7=288
ReLU             Relu_17                  1 1 input.76 onnx::Conv_198
Convolution      Conv_18                  1 1 onnx::Conv_198 onnx::Add_644 0=72 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=20736
BinaryOp         Add_19                   2 1 input.60_splitncnn_0 onnx::Add_644 input.84 0=0
Split            splitncnn_2              1 2 input.84 input.84_splitncnn_0 input.84_splitncnn_1
Convolution      Conv_20                  1 1 input.84_splitncnn_1 input.92 0=288 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=20736
ReLU             Relu_21                  1 1 input.92 onnx::Conv_204
ConvolutionDepthWise Conv_22                  1 1 onnx::Conv_204 input.100 0=288 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2592 7=288
ReLU             Relu_23                  1 1 input.100 onnx::Conv_207
Convolution      Conv_24                  1 1 onnx::Conv_207 onnx::Add_653 0=72 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=20736
BinaryOp         Add_25                   2 1 input.84_splitncnn_0 onnx::Add_653 input.108 0=0
Split            splitncnn_3              1 2 input.108 input.108_splitncnn_0 input.108_splitncnn_1
Pooling          GlobalAveragePool_26     1 1 input.108_splitncnn_1 onnx::Reshape_213 0=1 4=1
Reshape          Reshape_27               1 1 onnx::Reshape_213 onnx::Gemm_217 0=72
InnerProduct     Gemm_28                  1 1 onnx::Gemm_217 input.112 0=9 1=1 2=648
ReLU             Relu_29                  1 1 input.112 onnx::Gemm_219
InnerProduct     Gemm_30                  1 1 onnx::Gemm_219 onnx::Sigmoid_220 0=72 1=1 2=648
Sigmoid          Sigmoid_31               1 1 onnx::Sigmoid_220 onnx::Reshape_221
Reshape          Reshape_32               1 1 onnx::Reshape_221 onnx::Mul_229 0=1 1=1 2=72
BinaryOp         Mul_33                   2 1 input.108_splitncnn_0 onnx::Mul_229 input.116 0=2
Convolution      Conv_34                  1 1 input.116 input.124 0=288 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=20736
ReLU             Relu_35                  1 1 input.124 onnx::Conv_233
ConvolutionDepthWise Conv_36                  1 1 onnx::Conv_233 input.132 0=288 1=3 11=3 2=1 12=1 3=1 13=2 4=1 14=1 15=1 16=1 5=1 6=2592 7=288
ReLU             Relu_37                  1 1 input.132 onnx::Conv_236
Convolution      Conv_38                  1 1 onnx::Conv_236 input.140 0=120 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=34560
Split            splitncnn_4              1 2 input.140 input.140_splitncnn_0 input.140_splitncnn_1
Convolution      Conv_39                  1 1 input.140_splitncnn_1 input.148 0=480 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=57600
ReLU             Relu_40                  1 1 input.148 onnx::Conv_241
ConvolutionDepthWise Conv_41                  1 1 onnx::Conv_241 input.156 0=480 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=4320 7=480
ReLU             Relu_42                  1 1 input.156 onnx::Conv_244
Convolution      Conv_43                  1 1 onnx::Conv_244 onnx::Add_671 0=120 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=57600
BinaryOp         Add_44                   2 1 input.140_splitncnn_0 onnx::Add_671 input.164 0=0
Split            splitncnn_5              1 2 input.164 input.164_splitncnn_0 input.164_splitncnn_1
Pooling          GlobalAveragePool_45     1 1 input.164_splitncnn_1 onnx::Reshape_250 0=1 4=1
Reshape          Reshape_46               1 1 onnx::Reshape_250 onnx::Gemm_254 0=120
InnerProduct     Gemm_47                  1 1 onnx::Gemm_254 input.168 0=15 1=1 2=1800
ReLU             Relu_48                  1 1 input.168 onnx::Gemm_256
InnerProduct     Gemm_49                  1 1 onnx::Gemm_256 onnx::Sigmoid_257 0=120 1=1 2=1800
Sigmoid          Sigmoid_50               1 1 onnx::Sigmoid_257 onnx::Reshape_258
Reshape          Reshape_51               1 1 onnx::Reshape_258 onnx::Mul_266 0=1 1=1 2=120
BinaryOp         Mul_52                   2 1 input.164_splitncnn_0 onnx::Mul_266 input.172 0=2
Convolution      Conv_53                  1 1 input.172 input.180 0=480 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=57600
ReLU             Relu_54                  1 1 input.180 onnx::Conv_270
ConvolutionDepthWise Conv_55                  1 1 onnx::Conv_270 input.188 0=480 1=3 11=3 2=1 12=1 3=1 13=2 4=1 14=1 15=1 16=1 5=1 6=4320 7=480
ReLU             Relu_56                  1 1 input.188 onnx::Conv_273
Convolution      Conv_57                  1 1 onnx::Conv_273 input.196 0=240 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=115200
Split            splitncnn_6              1 2 input.196 input.196_splitncnn_0 input.196_splitncnn_1
Pooling          GlobalAveragePool_58     1 1 input.196_splitncnn_1 onnx::Reshape_278 0=1 4=1
Reshape          Reshape_59               1 1 onnx::Reshape_278 onnx::Gemm_282 0=240
InnerProduct     Gemm_60                  1 1 onnx::Gemm_282 input.200 0=30 1=1 2=7200
ReLU             Relu_61                  1 1 input.200 onnx::Gemm_284
InnerProduct     Gemm_62                  1 1 onnx::Gemm_284 onnx::Sigmoid_285 0=240 1=1 2=7200
Sigmoid          Sigmoid_63               1 1 onnx::Sigmoid_285 onnx::Reshape_286
Reshape          Reshape_64               1 1 onnx::Reshape_286 onnx::Mul_294 0=1 1=1 2=240
BinaryOp         Mul_65                   2 1 input.196_splitncnn_0 onnx::Mul_294 onnx::MaxPool_295 0=2
Pooling          MaxPool_66               1 1 onnx::MaxPool_295 onnx::Squeeze_296 0=0 1=2 11=2 2=2 12=2 3=1 13=0 14=1 15=0 5=1
Squeeze          Squeeze_67               1 1 onnx::Squeeze_296 onnx::Transpose_297 -23303=1,1
Permute          Transpose_68             1 1 onnx::Transpose_297 input.204 0=1
LSTM             LSTM_85                  1 3 input.204 onnx::Reshape_440 436 437 0=128 1=245760 2=2
InnerProduct     Gemm_90                  1 1 onnx::Reshape_440 onnx::Reshape_449 0=128 1=1 2=32768
LSTM             LSTM_108                 1 3 onnx::Reshape_449 onnx::Reshape_597 593 594 0=128 1=131072 2=2
InnerProduct     Gemm_113                 1 1 onnx::Reshape_597 onnx::Reshape_606 0=96 1=1 2=24576
Softmax          Softmax_115              1 1 onnx::Reshape_606 output 0=1 1=1
