7767517
101 112
Input            input                    0 1 input
Convolution      Conv_0                   1 1 input input.4 0=16 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=432
ReLU             Relu_1                   1 1 input.4 onnx::Conv_259
Convolution      Conv_2                   1 1 onnx::Conv_259 input.12 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
ReLU             Relu_3                   1 1 input.12 onnx::Conv_262
Convolution      Conv_4                   1 1 onnx::Conv_262 input.20 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
ReLU             Relu_5                   1 1 input.20 onnx::Conv_265
ConvolutionDepthWise Conv_6                   1 1 onnx::Conv_265 input.28 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=288 7=32
ReLU             Relu_7                   1 1 input.28 onnx::Conv_268
Convolution      Conv_8                   1 1 onnx::Conv_268 input.36 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Split            splitncnn_0              1 2 input.36 input.36_splitncnn_0 input.36_splitncnn_1
Convolution      Conv_9                   1 1 input.36_splitncnn_1 input.44 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
ReLU             Relu_10                  1 1 input.44 onnx::Conv_273
ConvolutionDepthWise Conv_11                  1 1 onnx::Conv_273 input.52 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=288 7=32
ReLU             Relu_12                  1 1 input.52 onnx::Conv_276
Convolution      Conv_13                  1 1 onnx::Conv_276 onnx::Add_424 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
BinaryOp         Add_14                   2 1 input.36_splitncnn_0 onnx::Add_424 input.60 0=0
Split            splitncnn_1              1 2 input.60 input.60_splitncnn_0 input.60_splitncnn_1
Convolution      Conv_15                  1 1 input.60_splitncnn_1 input.68 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
ReLU             Relu_16                  1 1 input.68 onnx::Conv_282
ConvolutionDepthWise Conv_17                  1 1 onnx::Conv_282 input.76 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=288 7=32
ReLU             Relu_18                  1 1 input.76 onnx::Conv_285
Convolution      Conv_19                  1 1 onnx::Conv_285 onnx::Add_433 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
BinaryOp         Add_20                   2 1 input.60_splitncnn_0 onnx::Add_433 input.84 0=0
Split            splitncnn_2              1 2 input.84 input.84_splitncnn_0 input.84_splitncnn_1
Convolution      Conv_21                  1 1 input.84_splitncnn_1 input.92 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
ReLU             Relu_22                  1 1 input.92 onnx::Conv_291
ConvolutionDepthWise Conv_23                  1 1 onnx::Conv_291 input.100 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=288 7=32
ReLU             Relu_24                  1 1 input.100 onnx::Conv_294
Convolution      Conv_25                  1 1 onnx::Conv_294 onnx::Add_442 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
BinaryOp         Add_26                   2 1 input.84_splitncnn_0 onnx::Add_442 input.108 0=0
Split            splitncnn_3              1 2 input.108 input.108_splitncnn_0 input.108_splitncnn_1
Convolution      Conv_27                  1 1 input.108_splitncnn_1 input.116 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
ReLU             Relu_28                  1 1 input.116 onnx::Conv_300
ConvolutionDepthWise Conv_29                  1 1 onnx::Conv_300 input.124 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=288 7=32
ReLU             Relu_30                  1 1 input.124 onnx::Conv_303
Convolution      Conv_31                  1 1 onnx::Conv_303 onnx::Add_451 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
BinaryOp         Add_32                   2 1 input.108_splitncnn_0 onnx::Add_451 input.132 0=0
Convolution      Conv_33                  1 1 input.132 input.140 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
ReLU             Relu_34                  1 1 input.140 onnx::Conv_309
ConvolutionDepthWise Conv_35                  1 1 onnx::Conv_309 input.148 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=288 7=32
ReLU             Relu_36                  1 1 input.148 onnx::Conv_312
Convolution      Conv_37                  1 1 onnx::Conv_312 input.156 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
Convolution      Conv_38                  1 1 input.156 input.164 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
ReLU             Relu_39                  1 1 input.164 onnx::Conv_317
ConvolutionDepthWise Conv_40                  1 1 onnx::Conv_317 input.172 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             Relu_41                  1 1 input.172 onnx::Conv_320
Convolution      Conv_42                  1 1 onnx::Conv_320 input.180 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
Split            splitncnn_4              1 2 input.180 input.180_splitncnn_0 input.180_splitncnn_1
Convolution      Conv_43                  1 1 input.180_splitncnn_1 input.188 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
ReLU             Relu_44                  1 1 input.188 onnx::Conv_325
ConvolutionDepthWise Conv_45                  1 1 onnx::Conv_325 input.196 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             Relu_46                  1 1 input.196 onnx::Conv_328
Convolution      Conv_47                  1 1 onnx::Conv_328 onnx::Add_478 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
BinaryOp         Add_48                   2 1 input.180_splitncnn_0 onnx::Add_478 input.204 0=0
Split            splitncnn_5              1 2 input.204 input.204_splitncnn_0 input.204_splitncnn_1
Convolution      Conv_49                  1 1 input.204_splitncnn_1 input.212 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
ReLU             Relu_50                  1 1 input.212 onnx::Conv_334
ConvolutionDepthWise Conv_51                  1 1 onnx::Conv_334 input.220 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             Relu_52                  1 1 input.220 onnx::Conv_337
Convolution      Conv_53                  1 1 onnx::Conv_337 onnx::Add_487 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
BinaryOp         Add_54                   2 1 input.204_splitncnn_0 onnx::Add_487 input.228 0=0
Split            splitncnn_6              1 2 input.228 input.228_splitncnn_0 input.228_splitncnn_1
Convolution      Conv_55                  1 1 input.228_splitncnn_1 input.236 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
ReLU             Relu_56                  1 1 input.236 onnx::Conv_343
ConvolutionDepthWise Conv_57                  1 1 onnx::Conv_343 input.244 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             Relu_58                  1 1 input.244 onnx::Conv_346
Convolution      Conv_59                  1 1 onnx::Conv_346 onnx::Add_496 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
BinaryOp         Add_60                   2 1 input.228_splitncnn_0 onnx::Add_496 input.252 0=0
Split            splitncnn_7              1 2 input.252 input.252_splitncnn_0 input.252_splitncnn_1
Convolution      Conv_61                  1 1 input.252_splitncnn_1 input.260 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
ReLU             Relu_62                  1 1 input.260 onnx::Conv_352
ConvolutionDepthWise Conv_63                  1 1 onnx::Conv_352 input.268 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             Relu_64                  1 1 input.268 onnx::Conv_355
Convolution      Conv_65                  1 1 onnx::Conv_355 onnx::Add_505 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
BinaryOp         Add_66                   2 1 input.252_splitncnn_0 onnx::Add_505 input.276 0=0
Split            splitncnn_8              1 2 input.276 input.276_splitncnn_0 input.276_splitncnn_1
Convolution      Conv_67                  1 1 input.276_splitncnn_1 input.284 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
ReLU             Relu_68                  1 1 input.284 onnx::Conv_361
ConvolutionDepthWise Conv_69                  1 1 onnx::Conv_361 input.292 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             Relu_70                  1 1 input.292 onnx::Conv_364
Convolution      Conv_71                  1 1 onnx::Conv_364 onnx::Add_514 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
BinaryOp         Add_72                   2 1 input.276_splitncnn_0 onnx::Add_514 input.300 0=0
Convolution      Conv_73                  1 1 input.300 input.308 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2048
ReLU             Relu_74                  1 1 input.308 onnx::Conv_370
ConvolutionDepthWise Conv_75                  1 1 onnx::Conv_370 input.316 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             Relu_76                  1 1 input.316 onnx::Conv_373
Convolution      Conv_77                  1 1 onnx::Conv_373 input.324 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
Split            splitncnn_9              1 2 input.324 input.324_splitncnn_0 input.324_splitncnn_1
Pooling          GlobalAveragePool_78     1 1 input.324_splitncnn_1 onnx::Reshape_376 0=1 4=1
Reshape          Reshape_79               1 1 onnx::Reshape_376 onnx::Concat_382 0=-1
Convolution      Conv_80                  1 1 input.324_splitncnn_0 input.332 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=4608
ReLU             Relu_81                  1 1 input.332 onnx::GlobalAveragePool_385
Split            splitncnn_10             1 2 onnx::GlobalAveragePool_385 onnx::GlobalAveragePool_385_splitncnn_0 onnx::GlobalAveragePool_385_splitncnn_1
Pooling          GlobalAveragePool_82     1 1 onnx::GlobalAveragePool_385_splitncnn_1 onnx::Reshape_386 0=1 4=1
Reshape          Reshape_83               1 1 onnx::Reshape_386 onnx::Concat_392 0=-1
Convolution      Conv_84                  1 1 onnx::GlobalAveragePool_385_splitncnn_0 input.336 0=128 1=7 11=7 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=200704
ReLU             Relu_85                  1 1 input.336 onnx::Reshape_394
Reshape          Reshape_86               1 1 onnx::Reshape_394 onnx::Concat_400 0=-1
Concat           Concat_87                3 1 onnx::Concat_382 onnx::Concat_392 onnx::Concat_400 onnx::Gemm_401 0=0
InnerProduct     Gemm_88                  1 1 onnx::Gemm_401 output 0=8 1=1 2=1408
