7767517
173 197
Input            images                   0 1 images
Convolution      Conv_0                   1 1 images input 0=32 1=6 11=6 2=1 12=1 3=2 13=2 4=2 14=2 15=2 16=2 5=1 6=3456
Swish            Mul_2                    1 1 input onnx::Conv_124
Convolution      Conv_3                   1 1 onnx::Conv_124 input.4 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=18432
Swish            Mul_5                    1 1 input.4 onnx::Conv_127
Split            splitncnn_0              1 2 onnx::Conv_127 onnx::Conv_127_splitncnn_0 onnx::Conv_127_splitncnn_1
Convolution      Conv_6                   1 1 onnx::Conv_127_splitncnn_1 input.8 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2048
Swish            Mul_8                    1 1 input.8 onnx::Conv_130
Split            splitncnn_1              1 2 onnx::Conv_130 onnx::Conv_130_splitncnn_0 onnx::Conv_130_splitncnn_1
Convolution      Conv_9                   1 1 onnx::Conv_130_splitncnn_1 input.12 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
Swish            Mul_11                   1 1 input.12 onnx::Conv_133
Convolution      Conv_12                  1 1 onnx::Conv_133 input.16 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=9216
Swish            Mul_14                   1 1 input.16 onnx::Add_136
BinaryOp         Add_15                   2 1 onnx::Conv_130_splitncnn_0 onnx::Add_136 onnx::Concat_137 0=0
Convolution      Conv_16                  1 1 onnx::Conv_127_splitncnn_0 input.20 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2048
Swish            Mul_18                   1 1 input.20 onnx::Concat_140
Concat           Concat_19                2 1 onnx::Concat_137 onnx::Concat_140 input.24 0=0
Convolution      Conv_20                  1 1 input.24 input.28 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
Swish            Mul_22                   1 1 input.28 onnx::Conv_144
Convolution      Conv_23                  1 1 onnx::Conv_144 input.32 0=128 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=73728
Swish            Mul_25                   1 1 input.32 onnx::Conv_147
Split            splitncnn_2              1 2 onnx::Conv_147 onnx::Conv_147_splitncnn_0 onnx::Conv_147_splitncnn_1
Convolution      Conv_26                  1 1 onnx::Conv_147_splitncnn_1 input.36 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
Swish            Mul_28                   1 1 input.36 onnx::Conv_150
Split            splitncnn_3              1 2 onnx::Conv_150 onnx::Conv_150_splitncnn_0 onnx::Conv_150_splitncnn_1
Convolution      Conv_29                  1 1 onnx::Conv_150_splitncnn_1 input.40 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
Swish            Mul_31                   1 1 input.40 onnx::Conv_153
Convolution      Conv_32                  1 1 onnx::Conv_153 input.44 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
Swish            Mul_34                   1 1 input.44 onnx::Add_156
BinaryOp         Add_35                   2 1 onnx::Conv_150_splitncnn_0 onnx::Add_156 input.48 0=0
Split            splitncnn_4              1 2 input.48 input.48_splitncnn_0 input.48_splitncnn_1
Convolution      Conv_36                  1 1 input.48_splitncnn_1 input.52 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
Swish            Mul_38                   1 1 input.52 onnx::Conv_160
Convolution      Conv_39                  1 1 onnx::Conv_160 input.56 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
Swish            Mul_41                   1 1 input.56 onnx::Add_163
BinaryOp         Add_42                   2 1 input.48_splitncnn_0 onnx::Add_163 onnx::Concat_164 0=0
Convolution      Conv_43                  1 1 onnx::Conv_147_splitncnn_0 input.60 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
Swish            Mul_45                   1 1 input.60 onnx::Concat_167
Concat           Concat_46                2 1 onnx::Concat_164 onnx::Concat_167 input.64 0=0
Convolution      Conv_47                  1 1 input.64 input.68 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
Swish            Mul_49                   1 1 input.68 onnx::Conv_171
Split            splitncnn_5              1 2 onnx::Conv_171 onnx::Conv_171_splitncnn_0 onnx::Conv_171_splitncnn_1
Convolution      Conv_50                  1 1 onnx::Conv_171_splitncnn_1 input.72 0=256 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=294912
Swish            Mul_52                   1 1 input.72 onnx::Conv_174
Split            splitncnn_6              1 2 onnx::Conv_174 onnx::Conv_174_splitncnn_0 onnx::Conv_174_splitncnn_1
Convolution      Conv_53                  1 1 onnx::Conv_174_splitncnn_1 input.76 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
Swish            Mul_55                   1 1 input.76 onnx::Conv_177
Split            splitncnn_7              1 2 onnx::Conv_177 onnx::Conv_177_splitncnn_0 onnx::Conv_177_splitncnn_1
Convolution      Conv_56                  1 1 onnx::Conv_177_splitncnn_1 input.80 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
Swish            Mul_58                   1 1 input.80 onnx::Conv_180
Convolution      Conv_59                  1 1 onnx::Conv_180 input.84 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
Swish            Mul_61                   1 1 input.84 onnx::Add_183
BinaryOp         Add_62                   2 1 onnx::Conv_177_splitncnn_0 onnx::Add_183 input.88 0=0
Split            splitncnn_8              1 2 input.88 input.88_splitncnn_0 input.88_splitncnn_1
Convolution      Conv_63                  1 1 input.88_splitncnn_1 input.92 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
Swish            Mul_65                   1 1 input.92 onnx::Conv_187
Convolution      Conv_66                  1 1 onnx::Conv_187 input.96 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
Swish            Mul_68                   1 1 input.96 onnx::Add_190
BinaryOp         Add_69                   2 1 input.88_splitncnn_0 onnx::Add_190 input.100 0=0
Split            splitncnn_9              1 2 input.100 input.100_splitncnn_0 input.100_splitncnn_1
Convolution      Conv_70                  1 1 input.100_splitncnn_1 input.104 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
Swish            Mul_72                   1 1 input.104 onnx::Conv_194
Convolution      Conv_73                  1 1 onnx::Conv_194 input.108 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
Swish            Mul_75                   1 1 input.108 onnx::Add_197
BinaryOp         Add_76                   2 1 input.100_splitncnn_0 onnx::Add_197 onnx::Concat_198 0=0
Convolution      Conv_77                  1 1 onnx::Conv_174_splitncnn_0 input.112 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
Swish            Mul_79                   1 1 input.112 onnx::Concat_201
Concat           Concat_80                2 1 onnx::Concat_198 onnx::Concat_201 input.116 0=0
Convolution      Conv_81                  1 1 input.116 input.120 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
Swish            Mul_83                   1 1 input.120 onnx::Conv_205
Split            splitncnn_10             1 2 onnx::Conv_205 onnx::Conv_205_splitncnn_0 onnx::Conv_205_splitncnn_1
Convolution      Conv_84                  1 1 onnx::Conv_205_splitncnn_1 input.124 0=512 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=1179648
Swish            Mul_86                   1 1 input.124 onnx::Conv_208
Split            splitncnn_11             1 2 onnx::Conv_208 onnx::Conv_208_splitncnn_0 onnx::Conv_208_splitncnn_1
Convolution      Conv_87                  1 1 onnx::Conv_208_splitncnn_1 input.128 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=131072
Swish            Mul_89                   1 1 input.128 onnx::Conv_211
Split            splitncnn_12             1 2 onnx::Conv_211 onnx::Conv_211_splitncnn_0 onnx::Conv_211_splitncnn_1
Convolution      Conv_90                  1 1 onnx::Conv_211_splitncnn_1 input.132 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
Swish            Mul_92                   1 1 input.132 onnx::Conv_214
Convolution      Conv_93                  1 1 onnx::Conv_214 input.136 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=589824
Swish            Mul_95                   1 1 input.136 onnx::Add_217
BinaryOp         Add_96                   2 1 onnx::Conv_211_splitncnn_0 onnx::Add_217 onnx::Concat_218 0=0
Convolution      Conv_97                  1 1 onnx::Conv_208_splitncnn_0 input.140 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=131072
Swish            Mul_99                   1 1 input.140 onnx::Concat_221
Concat           Concat_100               2 1 onnx::Concat_218 onnx::Concat_221 input.144 0=0
Convolution      Conv_101                 1 1 input.144 input.148 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=262144
Swish            Mul_103                  1 1 input.148 onnx::Conv_225
Convolution      Conv_104                 1 1 onnx::Conv_225 input.152 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=131072
Swish            Mul_106                  1 1 input.152 onnx::MaxPool_228
Split            splitncnn_13             1 2 onnx::MaxPool_228 onnx::MaxPool_228_splitncnn_0 onnx::MaxPool_228_splitncnn_1
Pooling          MaxPool_107              1 1 onnx::MaxPool_228_splitncnn_1 onnx::MaxPool_229 0=0 1=5 11=5 2=1 12=1 3=2 13=2 14=2 15=2 5=1
Split            splitncnn_14             1 2 onnx::MaxPool_229 onnx::MaxPool_229_splitncnn_0 onnx::MaxPool_229_splitncnn_1
Pooling          MaxPool_108              1 1 onnx::MaxPool_229_splitncnn_1 onnx::MaxPool_230 0=0 1=5 11=5 2=1 12=1 3=2 13=2 14=2 15=2 5=1
Split            splitncnn_15             1 2 onnx::MaxPool_230 onnx::MaxPool_230_splitncnn_0 onnx::MaxPool_230_splitncnn_1
Pooling          MaxPool_109              1 1 onnx::MaxPool_230_splitncnn_1 onnx::Concat_231 0=0 1=5 11=5 2=1 12=1 3=2 13=2 14=2 15=2 5=1
Concat           Concat_110               4 1 onnx::MaxPool_228_splitncnn_0 onnx::MaxPool_229_splitncnn_0 onnx::MaxPool_230_splitncnn_0 onnx::Concat_231 input.156 0=0
Convolution      Conv_111                 1 1 input.156 input.160 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=524288
Swish            Mul_113                  1 1 input.160 onnx::Conv_235
Convolution      Conv_114                 1 1 onnx::Conv_235 input.164 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=131072
Swish            Mul_116                  1 1 input.164 onnx::Resize_238
Split            splitncnn_16             1 2 onnx::Resize_238 onnx::Resize_238_splitncnn_0 onnx::Resize_238_splitncnn_1
Interp           Resize_121               1 1 onnx::Resize_238_splitncnn_1 onnx::Concat_243 0=1 1=2.000000e+00 2=2.000000e+00 3=0 4=0 6=0
Concat           Concat_122               2 1 onnx::Concat_243 onnx::Conv_205_splitncnn_0 input.168 0=0
Split            splitncnn_17             1 2 input.168 input.168_splitncnn_0 input.168_splitncnn_1
Convolution      Conv_123                 1 1 input.168_splitncnn_1 input.172 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
Swish            Mul_125                  1 1 input.172 onnx::Conv_247
Convolution      Conv_126                 1 1 onnx::Conv_247 input.176 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
Swish            Mul_128                  1 1 input.176 onnx::Conv_250
Convolution      Conv_129                 1 1 onnx::Conv_250 input.180 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
Swish            Mul_131                  1 1 input.180 onnx::Concat_253
Convolution      Conv_132                 1 1 input.168_splitncnn_0 input.184 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
Swish            Mul_134                  1 1 input.184 onnx::Concat_256
Concat           Concat_135               2 1 onnx::Concat_253 onnx::Concat_256 input.188 0=0
Convolution      Conv_136                 1 1 input.188 input.192 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
Swish            Mul_138                  1 1 input.192 onnx::Conv_260
Convolution      Conv_139                 1 1 onnx::Conv_260 input.196 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
Swish            Mul_141                  1 1 input.196 onnx::Resize_263
Split            splitncnn_18             1 2 onnx::Resize_263 onnx::Resize_263_splitncnn_0 onnx::Resize_263_splitncnn_1
Interp           Resize_146               1 1 onnx::Resize_263_splitncnn_1 onnx::Concat_268 0=1 1=2.000000e+00 2=2.000000e+00 3=0 4=0 6=0
Concat           Concat_147               2 1 onnx::Concat_268 onnx::Conv_171_splitncnn_0 input.200 0=0
Split            splitncnn_19             1 2 input.200 input.200_splitncnn_0 input.200_splitncnn_1
Convolution      Conv_148                 1 1 input.200_splitncnn_1 input.204 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
Swish            Mul_150                  1 1 input.204 onnx::Conv_272
Convolution      Conv_151                 1 1 onnx::Conv_272 input.208 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
Swish            Mul_153                  1 1 input.208 onnx::Conv_275
Convolution      Conv_154                 1 1 onnx::Conv_275 input.212 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
Swish            Mul_156                  1 1 input.212 onnx::Concat_278
Convolution      Conv_157                 1 1 input.200_splitncnn_0 input.216 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
Swish            Mul_159                  1 1 input.216 onnx::Concat_281
Concat           Concat_160               2 1 onnx::Concat_278 onnx::Concat_281 input.220 0=0
Convolution      Conv_161                 1 1 input.220 input.224 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
Swish            Mul_163                  1 1 input.224 onnx::Conv_285
Split            splitncnn_20             1 2 onnx::Conv_285 onnx::Conv_285_splitncnn_0 onnx::Conv_285_splitncnn_1
Convolution      Conv_164                 1 1 onnx::Conv_285_splitncnn_1 input.228 0=128 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=147456
Swish            Mul_166                  1 1 input.228 onnx::Concat_288
Concat           Concat_167               2 1 onnx::Concat_288 onnx::Resize_263_splitncnn_0 input.232 0=0
Split            splitncnn_21             1 2 input.232 input.232_splitncnn_0 input.232_splitncnn_1
Convolution      Conv_168                 1 1 input.232_splitncnn_1 input.236 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
Swish            Mul_170                  1 1 input.236 onnx::Conv_292
Convolution      Conv_171                 1 1 onnx::Conv_292 input.240 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
Swish            Mul_173                  1 1 input.240 onnx::Conv_295
Convolution      Conv_174                 1 1 onnx::Conv_295 input.244 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
Swish            Mul_176                  1 1 input.244 onnx::Concat_298
Convolution      Conv_177                 1 1 input.232_splitncnn_0 input.248 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
Swish            Mul_179                  1 1 input.248 onnx::Concat_301
Concat           Concat_180               2 1 onnx::Concat_298 onnx::Concat_301 input.252 0=0
Convolution      Conv_181                 1 1 input.252 input.256 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
Swish            Mul_183                  1 1 input.256 onnx::Conv_305
Split            splitncnn_22             1 2 onnx::Conv_305 onnx::Conv_305_splitncnn_0 onnx::Conv_305_splitncnn_1
Convolution      Conv_184                 1 1 onnx::Conv_305_splitncnn_1 input.260 0=256 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=589824
Swish            Mul_186                  1 1 input.260 onnx::Concat_308
Concat           Concat_187               2 1 onnx::Concat_308 onnx::Resize_238_splitncnn_0 input.264 0=0
Split            splitncnn_23             1 2 input.264 input.264_splitncnn_0 input.264_splitncnn_1
Convolution      Conv_188                 1 1 input.264_splitncnn_1 input.268 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=131072
Swish            Mul_190                  1 1 input.268 onnx::Conv_312
Convolution      Conv_191                 1 1 onnx::Conv_312 input.272 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
Swish            Mul_193                  1 1 input.272 onnx::Conv_315
Convolution      Conv_194                 1 1 onnx::Conv_315 input.276 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=589824
Swish            Mul_196                  1 1 input.276 onnx::Concat_318
Convolution      Conv_197                 1 1 input.264_splitncnn_0 input.280 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=131072
Swish            Mul_199                  1 1 input.280 onnx::Concat_321
Concat           Concat_200               2 1 onnx::Concat_318 onnx::Concat_321 input.284 0=0
Convolution      Conv_201                 1 1 input.284 input.288 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=262144
Swish            Mul_203                  1 1 input.288 onnx::Conv_325
Convolution      Conv_204                 1 1 onnx::Conv_285_splitncnn_0 onnx::Reshape_326 0=21 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2688
Reshape          Reshape_216              1 1 onnx::Reshape_326 onnx::Transpose_338 0=-1 1=7 2=3
Permute          Transpose_217            1 1 onnx::Transpose_338 output 0=1
Convolution      Conv_218                 1 1 onnx::Conv_305_splitncnn_0 onnx::Reshape_340 0=21 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=5376
Reshape          Reshape_230              1 1 onnx::Reshape_340 onnx::Transpose_352 0=-1 1=7 2=3
Permute          Transpose_231            1 1 onnx::Transpose_352 353 0=1
Convolution      Conv_232                 1 1 onnx::Conv_325 onnx::Reshape_354 0=21 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=10752
Reshape          Reshape_244              1 1 onnx::Reshape_354 onnx::Transpose_366 0=-1 1=7 2=3
Permute          Transpose_245            1 1 onnx::Transpose_366 367 0=1
